{"<PAD>": 0, "<UNK>": 1, "static": 2, "void": 3, "FOCUS_FUNC": 4, "(": 5, ")": 6, "wchar_t": 7, "*": 8, "VAR1": 9, ";": 10, "=": 11, "malloc": 12, "NUMBER": 13, "sizeof": 14, "[": 15, "0": 16, "]": 17, "L'\\0'": 18, "VAR2": 19, "wmemset": 20, ",": 21, "L'A'": 22, "-": 23, "1": 24, "VAR3": 25, "wcsncpy": 26, "VAR4": 27, "wcslen": 28, "FUNC1": 29, "free": 30, "int": 31, "if": 32, "char": 33, "recv": 34, "acceptSocket": 35, "CHAR_ARRAY_SIZE": 36, "'CHAR'": 37, "atoi": 38, ">=": 39, "{": 40, "for": 41, "VAR5": 42, "<": 43, "10": 44, "++": 45, "FUNC2": 46, "else": 47, "FUNC3": 48, "\"STRING\"": 49, "&": 50, "strlen": 51, ">": 52, "fgets": 53, "data": 54, "+": 55, "dataLen": 56, "stdin": 57, "!=": 58, "NULL": 59, "&&": 60, "==": 61, "L'C'": 62, "5": 63, "VAR6": 64, "do": 65, "connectSocket": 66, "/": 67, "VAR7": 68, "wcschr": 69, "L'\\r'": 70, "L'\\n'": 71, "GLOBAL_CONST_TRUE": 72, "alloca": 73, ".": 74, "FUNC4": 75, "globalFive": 76, "strchr": 77, "SNPRINTF": 78, "L\"%s\"": 79, "return": 80, "INT_MAX": 81, "2": 82, "VAR8": 83, "ENV_VARIABLE": 84, "environment": 85, "wcsncat": 86, "L\"\"": 87, "switch": 88, "6": 89, "case": 90, ":": 91, "wcscpy": 92, "fgetws": 93, "memset": 94, "memcpy": 95, "strncat": 96, "struct": 97, "service": 98, "}": 99, "strcpy": 100, "GLOBAL_CONST_FALSE": 101, "memmove": 102, "GLOBAL_CONST_FIVE": 103, "SRC_STR": 104, "...": 105, "vsnprintf": 106, "args": 107, "wcscat": 108, "strncpy": 109, "double": 110, "default": 111, "FUNC5": 112, "globalTrue": 113, "7": 114, "VAR9": 115, "VAR10": 116, "VAR11": 117, "POPEN": 118, "L\"w\"": 119, "INT_MIN": 120, "short": 121, "RAND32": 122, "fopen": 123, "FILENAME": 124, "pFile": 125, "fclose": 126, "calloc": 127, "while": 128, "--": 129, "SYSTEM": 130, "exit": 131, "SHRT_MIN": 132, "SHRT_MAX": 133, "dataPtr1": 134, "wprintf": 135, "L\"%s\\n\"": 136, "CHAR_MAX": 137, "unsigned": 138, "va_start": 139, "->": 140, "globalFalse": 141, "WIDE_STRING": 142, "printf": 143, "inputBuffer": 144, "strcat": 145, "int64_t": 146, "abs": 147, "long": 148, "sqrt": 149, "UINT_MAX": 150, "_vsnwprintf": 151, "<=": 152, "CHAR_MIN": 153, "L\"fixedstringtest\"": 154, "L\"*.*\"": 155, "dataPtr2": 156, "8": 157, "CHAR_STRING": 158, "buffer": 159, "dataPtr": 160, "FUNC6": 161, "dataArray": 162, "myUnion": 163, "unionSecond": 164, "myStruct": 165, "structFirst": 166, "dataCopy": 167}